Revit 2026 API

# ExternalCommandsDataAvailabilityClassName Property

---

The full class name for the class providing the entry point to decide availability of this menu item.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string AvailabilityClassName { get; set; }
```
```vb
Public Property AvailabilityClassName As String
	Get
	Set
```
```cpp
public:
property String^ AvailabilityClassName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member AvailabilityClassName : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

This is the class implementing IExternalCommandAvailability interface.

#### Reference

ExternalCommandsData Class

Autodesk.Revit.UI Namespace